DataProcessors/ПросроченныеОплатыПоРеализациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПросроченныеОплатыПоРеализациям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыКомпании</Name>
			<Comment>Блок учета взаиморасчетов с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма долга в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма долга в валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции взаиморасчетов (оплата, предоплата...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, с которым мы ведем взаиморасчеты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>Документ отгрузки/поставки/оплаты по которому образовался долг</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ПросроченныеОплатыПоРеализациям/Ext/ObjectModule.bsl
Функция СформироватьТаблицуПросроченныхОплат() Экспорт
	
	Если обЗначениеНеЗаполнено(Контрагент) Тогда
		Возврат 0;
 	КонецЕсли; 
	
 	Если обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
		Возврат 0;
 	КонецЕсли; 
		
	Если Не обЗначениеНеЗаполнено(Дата) Тогда
		ДатаРасчета = КонецДня(Дата);	
 	Иначе	
        ДатаРасчета = КонецДня(ТекущаяДата());	
  	КонецЕсли; 
	
 	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыКомпанииОстатки.Контрагент,
	               |	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка,
	               |	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК Сумма,
	               |	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности КАК СрокОплатыЗадолженности,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка.Дата КАК ДатаСделки,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка.ХозОперация.Родитель КАК СделкаХозОперацияРодитель,
	               |	ДОБАВИТЬКДАТЕ(ВзаиморасчетыКомпанииОстатки.Сделка.Дата, ДЕНЬ, ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности) КАК ОплатитьДо
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(
	               |			&ДатаРасчета,
	               |			Контрагент = &Контрагент
	               |				И ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов) КАК ВзаиморасчетыКомпанииОстатки
	               |ГДЕ
	               |	ВзаиморасчетыКомпанииОстатки.СуммаОстаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОплатитьДо УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент",    Контрагент);
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов   );
  	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	
	тзОтгрузкиТМЦ = Запрос.Выполнить().Выгрузить();
  
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыКомпанииОстатки.Контрагент,
	               |	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка,
	               |	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК Сумма,
	               |	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности КАК СрокОплатыЗадолженности,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка.Дата КАК ДатаСделки,
	               |	ВзаиморасчетыКомпанииОстатки.Сделка.ХозОперация.Родитель КАК СделкаХозОперацияРодитель,
	               |	ДОБАВИТЬКДАТЕ(ВзаиморасчетыКомпанииОстатки.Сделка.Дата, ДЕНЬ, ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.СрокОплатыЗадолженности) КАК ОплатитьДо
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(
	               |			&ДатаРасчета,
	               |			Контрагент = &Контрагент
	               |				И ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов) КАК ВзаиморасчетыКомпанииОстатки
	               |ГДЕ
	               |	ВзаиморасчетыКомпанииОстатки.СуммаОстаток < 0
	               |	И ТИПЗНАЧЕНИЯ(ВзаиморасчетыКомпанииОстатки.Сделка) = ТИП(Документ.Выписка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОплатитьДо УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент",    Контрагент);
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов   );
  	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	
	тзОплаты = Запрос.Выполнить().Выгрузить();
	
  	ОстатокДолга = -тзОплаты.Итог("Сумма")-тзОтгрузкиТМЦ.Итог("Сумма");
	
	СуммаНеразнесенныхОплат = -тзОплаты.Итог("Сумма");
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("МакетОплат");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.СуммаНеразнесенныхОплат = СуммаНеразнесенныхОплат;
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
 	ОбластьМакета.Параметры.ДатаРасчетаСтрокой = Формат(ДатаРасчета,"ДЛФ=DD");
  
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьМакета);
	
	ёё = 0;
	
	ПросрочкаСуществует = Ложь;
	
	СуммаПросроченнойЗадолженности = 0;
	
	Всего = 0; 
	
 	Для каждого Стр Из тзОтгрузкиТМЦ Цикл
		Если обЗначениеНеЗаполнено(Стр.ОплатитьДо) Тогда
			Продолжить;
 		КонецЕсли; 
		Если КонецДня(Стр.ОплатитьДо) > КонецДня(ДатаРасчета) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
 		Иначе	
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКрасная");
			ПросрочкаСуществует = Истина;
			СуммаПросроченнойЗадолженности = СуммаПросроченнойЗадолженности + Стр.Сумма;
		КонецЕсли; 
		ёё = ёё + 1;
 		ОбластьМакета.Параметры.Нстр = ёё;	
		ОбластьМакета.Параметры.Сделка = Стр.Сделка;
		ОбластьМакета.Параметры.СделкаДокумент = Стр.Сделка.ПолучитьОбъект();
		ОбластьМакета.Параметры.Сумма = Стр.Сумма;
		ОбластьМакета.Параметры.СрокОплатыЗадолженности = Стр.СрокОплатыЗадолженности;
		ОбластьМакета.Параметры.ДатаСделки = Формат(Стр.ДатаСделки,"ДЛФ=D");
		ОбластьМакета.Параметры.ОплатитьДо = Формат(Стр.ОплатитьДо,"ДЛФ=D");
		ТабДок.Вывести(ОбластьМакета);
		Всего = Всего + Стр.Сумма; 
 	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ОбОтчете = "Отчет сформирован "+Формат(ТекущаяДата(),"ДЛФ=DDT")+" пользователем "+СокрЛП(ПараметрыСеанса.Пользователь);
	ОбластьМакета.Параметры.Всего = Формат(Всего,"ЧЦ=15; ЧДЦ=2; ДЛФ=");
	ОбластьМакета.Параметры.СуммаПросроченнойЗадолженности = Формат(СуммаПросроченнойЗадолженности,"ЧЦ=15; ЧДЦ=2; ДЛФ=");
 	ТабДок.Вывести(ОбластьМакета);
	
	Если ПросрочкаСуществует Тогда
		ТабДок.АвтоМасштаб=Истина;
		ТабДок.ОтображатьСетку=Ложь;
		ТабДок.ТолькоПросмотр=Истина;
  		ТабДок.Показать("Взаиморасчеты с оптовиком "+Контрагент,,Истина);
		//Сообщить("Просроченные оплаты контрагента выведены в отдельном окне: Взаиморасчеты с оптовиком",СтатусСообщения.Информация);
	КонецЕсли;
	
	Возврат СуммаПросроченнойЗадолженности;
   
КонецФункции
 //Бондаренко-- 20200907
